{
    "version": "https://jsonfeed.org/version/1",
    "title": "DouglasPC.com",
    "description": "",
    "home_page_url": "https://brevardpc.com",
    "feed_url": "https://brevardpc.com/feed.json",
    "user_comment": "",
    "icon": "https://brevardpc.com/media/website/Douglas_PC_Logo.svg",
    "author": {
        "name": "Eric Douglas"
    },
    "items": [
        {
            "id": "https://brevardpc.com/services/",
            "url": "https://brevardpc.com/services/",
            "title": "Tech Services",
            "summary": "Offering a wide range of services with a high emphasis or mostly based on technical, computer, automations, and business tech services. We look&hellip;",
            "content_html": "<p>Offering a wide range of services with a high emphasis or mostly based on technical, computer, automations, and business tech services.  We look at your needs, requirements, and into the workflow of the processes involved so to provide a optimizations' of what we have seen in past, and recent research and discovery of many of todays top providers and innovators in several industries, including AI, marketing, sales, communications, internet, and connecting multiple locations with safe secure protections in place for traffic, emails, websites, and online reputation with compliance and future planning in mind.  We can help or take most of the managements of tech services role for your company or business.</p>\n<p>Technology is ever changing in the world, we enjoy keeping informed and knowledgeable about was we can help businesses best utilize the innovations of todays top talent.  If you struggle with keeping up to date on the most effective ways to modernize your business we would enjoy to be your trusted advisor to help find solutions to the areas that would benefit the most for your company.  Contact us for technical services, computer technical support, or tech equipment advisement, consulting, and sales for software and hardware equipment computers, laptops, and tablets.  Contact Douglas PC 321-302-0036, located in just north of Titusville, in Mims, FL.</p>\n<p> </p>",
            "author": {
                "name": "Eric Douglas"
            },
            "tags": [
            ],
            "date_published": "2024-01-14T16:11:47-05:00",
            "date_modified": "2024-01-20T22:40:06-05:00"
        }
    ]
}
